feat: add resolver to dispather to format comms templates in dish-ingredients
